<a href="https://colab.research.google.com/github/jeong-wooseok/R_Practice/blob/master/02_R_dataframe%EB%8B%A4%EB%A3%A8%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

[R 코랩만들기](https://colab.research.google.com/#create=true&language=r)

In [28]:
Manager <- c('1','2','3','4','5')
Date <- c('2014-10-24','2014-10-28','2014-01-10','2014-10-12','2014-05-01')
Country <- c('US','US','UK','UK','UK')
Gender <- c('M','F','F','M','F')
Age <- c(32,45,25,39,99)
q1 = c(5,3,3,3,2)
q2 <- c(4,5,5,3,2)
q3 <- c(5,2,5,4,1)
q4 <- c(5,5,5,NA,2)
q5 <- c(5,5,2,NA,1)

Manager<-data.frame(Manager,Date,Country,Gender,Age,q1,q2,q3,q4,q5)

## 데이터프레임 접근하기

In [29]:
# 데이터프레임에 인덱싱 접근 : 데이터프레임[행,열]
Manager

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
1 1       2014-10-24 US      M      32  5  4  5   5  5
2 2       2014-10-28 US      F      45  3  5  2   5  5
3 3       2014-01-10 UK      F      25  3  5  5   5  2
4 4       2014-10-12 UK      M      39  3  3  4  NA NA
5 5       2014-05-01 UK      F      99  2  2  1   2  1

In [30]:
# 인덱싱을 벡터로 일괄로 가져올 수도 있음
Manager[3,c(2:4)]

  Date       Country Gender
3 2014-01-10 UK      F

In [31]:
# 인덱싱을 컬럼명으로 가져올 수도 있음
Manager[3,'Age']

[1] 25

In [32]:
# 컬럼명도 백터로 넣을 수 있음
Manager[3,c('Country','Age')]

  Country Age
3 UK      25

In [33]:
# 특정 컬럼만 가져오고 싶음
Manager[,'Age']

[1] 32 45 25 39 99

In [34]:
# 특정 조건을 만족하는 데이터만 가져오고 싶음 : Boolian 활용
Manager[Manager$Age<30 & 20<Manager$Age,]
Manager[Manager$Gender=='M',]
Manager[40 <= Manager$Age,]

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
3 3       2014-01-10 UK      F      25  3  5  5  5  2

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
1 1       2014-10-24 US      M      32  5  4  5   5  5
4 4       2014-10-12 UK      M      39  3  3  4  NA NA

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
2 2       2014-10-28 US      F      45  3  5  2  5  5
5 5       2014-05-01 UK      F      99  2  2  1  2  1

In [35]:
Manager[Manager$Age <= 30 & Manager$Gender == 'F',]

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
3 3       2014-01-10 UK      F      25  3  5  5  5  2

## 범주형 컬럼 만들기

In [10]:
#Ages 범주형 컬럼 만들기
''' 나이 20-30 : 청년
31-45 : 중년
46-65 : 장년
66- : 노년 '''

ERROR: ignored

In [36]:
# 데이터프레임에 존재하지 않는 컬럼명을 넣이면 그 이름으로 새로운 컬럼이 추가됨
Manager$Ages[20<Manager$Age & Manager$Age <= 30] <- '청년'
Manager$Ages[30<Manager$Age & Manager$Age <= 45] <- '중년'
Manager$Ages[46<Manager$Age & Manager$Age <= 65] <- '장년'
Manager$Ages[65<Manager$Age ] <- '노년'

In [37]:
# 조건식이 2개 이상인 경우 가독성이 떨어지고 코드가 길어짐 : attach, with, within 을 활용 가능

In [38]:
# within은 작은 것부터 조건을 만들어줘야함 
Manager$ages2 <- rep(0,5)
Manager <- within(Manager,{
  ages2[Age<=30]<- '청년'
  ages2[Age>30]<- '중년'
  ages2[Age>46]<- '장년'
  ages2[Age>=66]<- '노년'
  })

In [39]:
Manager

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 Ages ages2
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년 중년
3 3       2014-01-10 UK      F      25  3  5  5   5  2 청년 청년
4 4       2014-10-12 UK      M      39  3  3  4  NA NA 중년 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년 노년

In [40]:
# 범주형 데이터 팩터 형태로 바꾸기
Manager$Ages <- as.factor(Manager$Ages)
Manager

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 Ages ages2
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년 중년
3 3       2014-01-10 UK      F      25  3  5  5   5  2 청년 청년
4 4       2014-10-12 UK      M      39  3  3  4  NA NA 중년 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년 노년

In [41]:
# 설문문항 컬럼의 총합과 평균의 컬럼을 만들어라

In [42]:
Manager <- within(Manager,{
  sumq <- q1+q2+q3+q4+q5
  meanq <- sumq/5
},na.rm = TRUE)

Manager

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 Ages ages2 meanq sumq
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년 중년  4.8   24
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년 중년  4.0   20
3 3       2014-01-10 UK      F      25  3  5  5   5  2 청년 청년  4.0   20
4 4       2014-10-12 UK      M      39  3  3  4  NA NA 중년 중년   NA   NA
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년 노년  1.6    8

## 결측치 다루기

In [43]:
x <- c(1,2,3,NA,5,NA,7)
# 결측치 여부 확인
sum(is.na(x))

[1] 2

In [44]:
# 결측치 제외하고 계산
sum(x,na.rm=T)

[1] 18

In [45]:
# 결측치 제거하기
x_nar <- na.omit(x) 
x
x_nar

[1]  1  2  3 NA  5 NA  7

[1] 1 2 3 5 7
attr(,"na.action")
[1] 4 6
attr(,"class")
[1] "omit"

In [46]:
# 결측치 대체하기 (평균값, 최빈값 등)
x_mean <- x 
x_mean[is.na(x)] <- mean(x,na.rm=T)
x_mean

[1] 1.0 2.0 3.0 3.6 5.0 3.6 7.0

In [47]:
# 사용예제
sum(Manager[4,c(6:10)],na.rm = TRUE)
mean(Manager[4,c(6:10)],na.rm = TRUE)
rowSums(Manager[,c(6:10)], na.rm = TRUE)

[1] 10

Warning message in mean.default(Manager[4, c(6:10)], na.rm = TRUE):
“argument is not numeric or logical: returning NA”

[1] NA

[1] 24 20 20 10  8

In [64]:
# 응용예제
url_e = 'https://raw.githubusercontent.com/jeong-wooseok/R_stastics/master/datasets/EMPLOYEES.csv'
url_z = 'https://raw.githubusercontent.com/jeong-wooseok/R_stastics/master/datasets/zipcode_20130201(2).txt'
emp <- read.csv(url_e)
zip2013 <- read.csv(url_z,sep = '\t',na.strings = '',stringsAsFactors = F)
# sep: 컬럼을 구분할 구분자 정의 (기본 : ,)
# na.strings : NA로 지정할 문자열 정의 => 빈문자열은 NA로 자동입력

head(emp)
head(zip2013)

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE  JOB_ID
1 100         Steven     King      SKING    515.123.4567 2003-06-17 AD_PRES
2 101         Neena      Kochhar   NKOCHHAR 515.123.4568 2005-09-21 AD_VP
3 102         Lex        De Haan   LDEHAAN  515.123.4569 2001-01-13 AD_VP
4 103         Alexander  Hunold    AHUNOLD  590.423.4567 2006-01-03 IT_PROG
5 104         Bruce      Ernst     BERNST   590.423.4568 2007-05-21 IT_PROG
6 105         David      Austin    DAUSTIN  590.423.4569 2005-06-25 IT_PROG
  SALARY COMMISSION_PCT MANAGER_ID DEPARTMENT_ID
1 24000  NA              NA        90
2 17000  NA             100        90
3 17000  NA             100        90
4  9000  NA             102        60
5  6000  NA             103        60
6  4800  NA             103        60

  ZIPCODE SIDO GUGUN  DONG    RI            BUNJI       SEQ
1 135-806 서울 강남구 개포1동 경남아파트    NA          1
2 135-807 서울 강남구 개포1동 우성3차아파트 (1∼6동)     2
3 135-806 서울 강남구 개포1동 우성9차아파트 (901∼902동) 3
4 135-770 서울 강남구 개포1동 주공아파트    (1∼16동)    4
5 135-805 서울 강남구 개포1동 주공아파트    (17∼40동)   5
6 135-966 서울 강남구 개포1동 주공아파트    (41∼85동)   6

In [65]:
# 컬럼별 NA 확인
colSums(is.na(emp))

   EMPLOYEE_ID     FIRST_NAME      LAST_NAME          EMAIL   PHONE_NUMBER
             0              0              0              0              0
     HIRE_DATE         JOB_ID         SALARY COMMISSION_PCT     MANAGER_ID
             0              0              0             72              1
 DEPARTMENT_ID
             1

In [66]:
# 수당 컬럼 대상으로 NA를 0으로 변경
emp$COMMISSION_PCT[is.na(emp$COMMISSION_PCT)] <- 0
head(emp)

  EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE  JOB_ID
1 100         Steven     King      SKING    515.123.4567 2003-06-17 AD_PRES
2 101         Neena      Kochhar   NKOCHHAR 515.123.4568 2005-09-21 AD_VP
3 102         Lex        De Haan   LDEHAAN  515.123.4569 2001-01-13 AD_VP
4 103         Alexander  Hunold    AHUNOLD  590.423.4567 2006-01-03 IT_PROG
5 104         Bruce      Ernst     BERNST   590.423.4568 2007-05-21 IT_PROG
6 105         David      Austin    DAUSTIN  590.423.4569 2005-06-25 IT_PROG
  SALARY COMMISSION_PCT MANAGER_ID DEPARTMENT_ID
1 24000  0               NA        90
2 17000  0              100        90
3 17000  0              100        90
4  9000  0              102        60
5  6000  0              103        60
6  4800  0              103        60

In [67]:
colSums(is.na(zip2013))

ZIPCODE    SIDO   GUGUN    DONG      RI   BUNJI     SEQ
      0       0     186       0   20489   31541       0

In [68]:
# NA 부분 빈칸으로 바꾸기
zip2013$GUGUN[is.na(zip2013$GUGUN)] <-''
zip2013$RI[is.na(zip2013$RI)] <-''
zip2013$BUNJI[is.na(zip2013$BUNJI)] <-''
colSums(is.na(zip2013))

ZIPCODE    SIDO   GUGUN    DONG      RI   BUNJI     SEQ
      0       0       0       0       0       0       0

In [ ]:
# 1973년, 뉴욕에서 수집한 일단 대기질 데이터인 airquality를 이용하여 결측치를 알아보고 적당한 값으로 대체하시오

In [80]:
air <- airquality
head(air,10)
colSums(is.na(air))
colSums(!is.na(air))

   Ozone Solar.R Wind Temp Month Day
1  41    190      7.4 67   5      1
2  36    118      8.0 72   5      2
3  12    149     12.6 74   5      3
4  18    313     11.5 62   5      4
5  NA     NA     14.3 56   5      5
6  28     NA     14.9 66   5      6
7  23    299      8.6 65   5      7
8  19     99     13.8 59   5      8
9   8     19     20.1 61   5      9
10 NA    194      8.6 69   5     10

  Ozone Solar.R    Wind    Temp   Month     Day
     37       7       0       0       0       0

  Ozone Solar.R    Wind    Temp   Month     Day
    116     146     153     153     153     153

In [77]:
air$Ozone[is.na(air$Ozone)]<- mean(air$Ozone,na.rm = T)
air$Solar.R[is.na(air$Solar.R)] <- mean(air$Solar.R, na.rm=T)
colSums(is.na(air))

  Ozone Solar.R    Wind    Temp   Month     Day
      0       0       0       0       0       0

## 자주 사용하는 데이터프레임 저장하기
save(객체명, 파일명)
load(파일명)
(단, 확장자는 rdata로 사용함)

공용으로 저장할 경우 : 
write.csv, write.table, write_csv, fwrite 함수를 사용한다

In [143]:
# R 내장데이터중 iris데이터셋을 iris.csv로 저장

In [ ]:
iris
write.csv(x=iris,'iris.csv',quote=F,row.names=F)
# qoute =f : 인용부호 제외

In [160]:
write.csv(Manager,'managers.csv',quote=F,row.names=F)